{"config": [{"config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-2c7d79a87289>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "output_shape": null, "arguments": {}, "name": "lambda_1", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "cropping": [[70, 20], [0, 0]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"nb_col": 5, "nb_filter": 24, "nb_row": 5, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "trainable": true, "b_constraint": null, "name": "convolution2d_1", "bias": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "nb_filter": 32, "nb_row": 5, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "trainable": true, "b_constraint": null, "name": "convolution2d_2", "bias": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "nb_filter": 48, "nb_row": 5, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "trainable": true, "b_constraint": null, "name": "convolution2d_3", "bias": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "nb_filter": 64, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "trainable": true, "b_constraint": null, "name": "convolution2d_4", "bias": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "nb_filter": 64, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "trainable": true, "b_constraint": null, "name": "convolution2d_5", "bias": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 100, "b_constraint": null, "name": "dense_1", "bias": true, "input_dim": 4224, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 50, "b_constraint": null, "name": "dense_2", "bias": true, "input_dim": 100, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 10, "b_constraint": null, "name": "dense_3", "bias": true, "input_dim": 50, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "linear", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "name": "dense_4", "bias": true, "input_dim": 10, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.2", "class_name": "Sequential"}